Repository: DmitryYatsyuk-dv/cs50x-trailquest
Catalog: Sandbox/TrailQuestSandbox/Resources/*.lproj/Localizable.strings
Languages: ru

# common.cancel
source: Cancel
ru: Отменить

# common.close
source: Close
ru: Закрыть

# common.delete
source: Delete
ru: Удалить

# common.got_it
source: Got it
ru: Понятно

# common.settings
source: Settings
ru: Настройки

# tab.routes
source: Routes
ru: Маршруты

# tab.history
source: History
ru: История

# tab.profile
source: Profile
ru: Профиль

# trail_list.title
source: Routes
ru: Маршруты

# trail_list.failure
source: Failed to load data
ru: Не удалось отобразить данные

# trail_detail.start
source: Start
ru: Старт

# trail_detail.points_count
source: Number of checkpoints: %d
ru: Число контрольных точек: %d

# trail_active.demo_alert
source: Demo mode is enabled. Bluetooth and camera permissions are required for real routes.
ru: Для демонстрации приложение использует тестовый режим. В реальном маршруте потребуется разрешение Bluetooth и камеры.

# trail_active.already_visited
source: You already visited this location!
ru: Вы уже посетили эту локацию!

# distance.km
source: %.1f km
ru: %.1f км

# history.title
source: History
ru: История

# history.empty
source: Competition history will appear here
ru: Здесь появится история соревнований

# history.progress
source: visited %d of %d
ru: посещено %d из %d

# summary.share_text
source: I completed the route %@: %@, time %@.
ru: Я прошёл маршрут %@: %@, время %@.

# checkin.sheet.subtitle
source: Check in at the checkpoint, using one of the methods
ru: Отметьтесь на контрольной точке, одним из способов

# checkin.manual.title
source: Enter code
ru: Ввести код

# checkin.manual.placeholder
source: e.g., 1284
ru: Например, 1284

# checkin.manual.invalid
source: Invalid code. Try again.
ru: Неверный код. Попробуйте снова.

# checkin.qr.title
source: Check in via QR
ru: Отметиться по QR

# checkin.qr.title_demo
source: Check in via QR (demo)
ru: Отметиться по QR (демо)

# checkin.qr.subtitle
source: Point the camera at the code
ru: Наведите камеру на код

# checkin.ble.title
source: Automatic check-in
ru: Автоматическая отметка

# checkin.ble.title_demo
source: Automatic check-in (demo)
ru: Автоматическая отметка (демо)

# checkin.ble.subtitle
source: Uses a nearby BLE beacon
ru: Использует BLE-маячок рядом

# checkin.demo.note
source: Demo mode. Checkpoints are marked automatically.
ru: Демо режим. Для демонстрации точки отмечаются автоматически.

# checkin.result.success
source: Checked in!
ru: Посещено!

# checkin.result.failure
source: Check-in failed
ru: Не удалось отметить

# checkin.result.retry
source: Try again
ru: Попробуйте снова

# checkin.ble.search_title
source: Searching for BLE beacon
ru: Поиск BLE-маячка

# checkin.ble.search_message
source: Keep your device near the checkpoint. Once the beacon is found, check-in will be available.
ru: Держите устройство рядом с контрольной точкой. Как только маяк будет найден, отметка станет доступной.

# checkin.ble.found
source: Beacon found
ru: Маяк найден

# checkin.ble.confirm
source: Confirm check-in
ru: Подтвердить отметку

# checkin.ble.searching
source: Searching for a nearby BLE beacon…
ru: Идёт поиск BLE-маячка поблизости…

# checkin.ble.alert_title
source: BLE unavailable
ru: BLE недоступен

# checkin.ble.permission_message
source: Allow location access to detect BLE beacons and confirm the checkpoint.
ru: Разрешите доступ к геопозиции, чтобы отслеживать BLE-маячки и подтверждать посещение точки.

# qr.alert.title
source: Camera access denied
ru: Нет доступа к камере

# qr.permission.denied
source: Camera access was denied
ru: Доступ к камере отклонён

# qr.permission.settings
source: Enable camera access in Settings
ru: Включите доступ к камере в настройках

# qr.permission.default_message
source: Allow camera access to scan QR codes.
ru: Разрешите доступ к камере, чтобы сканировать QR-коды.

# qr.camera.unavailable
source: Camera unavailable
ru: Камера недоступна

# qr.camera.configure_failed
source: Failed to configure the camera
ru: Не удалось настроить камеру

# qr.banner.scanning
source: Scanning…
ru: Сканируем…

# qr.instruction
source: Point the camera at the checkpoint QR code
ru: Наведите камеру на QR-код контрольной точки

source: QR detected
ru: QR обнаружен

# profile.title
source: Profile
ru: Профиль

# profile.delete
source: Delete profile
ru: Удалить профиль

# profile.save
source: Save
ru: Сохранить

# profile.name.label
source: Name
ru: Имя

# profile.photo.update
source: Update photo
ru: Обновить фото

# profile.photo.hint
source: Take a photo or choose an image from the gallery
ru: Сделайте фото или выберите изображение из галереи

# profile.photo.update_title
source: Update profile photo
ru: Обновить фото профиля

# profile.photo.take
source: Take photo
ru: Сделать фото

# profile.photo.pick
source: Choose from library
ru: Выбрать из галереи

# profile.camera.unavailable_title
source: Camera unavailable
ru: Камера недоступна

# profile.camera.unavailable_message
source: It looks like the camera is not available on this device.
ru: Похоже, камера недоступна на этом устройстве.

# profile.delete.confirm_title
source: Delete profile?
ru: Удалить профиль?

# profile.delete.confirm_message
source: This will delete all saved data and profile photo.
ru: Это удалит все сохранённые данные и фото профиля.

# profile.save.success
source: Saved
ru: Сохранено

# onboarding.back
source: Back
ru: Назад

# onboarding.start
source: Start
ru: Начать

# onboarding.next
source: Next
ru: Далее

# onboarding.page1.title
source: Discover new routes
ru: Открывай новые маршруты

# onboarding.page1.description
source: Choose walking, sports, and cultural routes in parks and districts. Each route is a path with interesting stops and stories.
ru: Выбирай прогулочные, спортивные и культурные маршруты в парках и районах города. Каждый маршрут — это путь с интересными точками и историей.

# onboarding.page2.title
source: Check in in different ways
ru: Проходи чекпоинты по-разному

# onboarding.page2.description
source: Mark checkpoints via QR codes, BLE beacons, or manually. Multiple check-in options make the journey convenient and interactive.
ru: Отмечай посещение точек с помощью QR-кодов, BLE-маячков или вручную. Несколько способов отметки делают путешествие удобным и интерактивным.

# onboarding.page3.title
source: See the whole route
ru: Видишь весь маршрут перед собой

# onboarding.page3.description
source: The map shows your progress: visited points, distance, and time. You always know what's done and what's ahead.
ru: Карта показывает твой прогресс: пройденные точки, расстояние и время. Ты всегда знаешь, что уже сделал и что впереди.

# onboarding.page4.title
source: Save and share achievements
ru: Сохраняй и делись достижениями

# onboarding.page4.description
source: Route history is saved on the device. Share results with friends, family, or your team.
ru: История маршрутов сохраняется на устройстве. Делись результатами с друзьями, семьёй или командой.
